Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
	        	skip_http_header();
	        	while(HAL_UART_Receive(&huart1, &c, 1, 50 ) == HAL_OK){}
	        	if(c == '0')
	        		set_menu_status_msg(STATUS_MESSAGE_PLUS_CONNECT_FAILED);
	        	else if(c == '1')
	        		set_menu_status_msg(STATUS_MESSAGE_PLUS_CREATED);
	        	else
	        		set_menu_status_msg(STATUS_MESSAGE_PLUS_CONNECTED);

	        	if( ! close_transparent_transmission() ){
	            	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
	        		return;
	        	}

	        	curPath[0] = '\0';
			}else{
				if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_CONNECT) == 0){
					set_menu_status_msg(STATUS_MESSAGE_PLUS_CONNECT);
				}

				make_menu_entry(&dst, "(GO BACK)", Leave_Menu); // TODO Delete last Char or All?
				make_menu_entry(&dst, "(DEL CHAR)", Delete_Keyboard_Char); // TODO Delete last Char or All?
				char Key[2] = "0";
				for (char i=32; i < 100; i++){
					Key[0] = i;
					make_menu_entry(&dst, Key, Keyboard_Char);
				}
				make_menu_entry(&dst, "Enter", Menu_Action);
			}
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_REMOVE, sizeof(MENU_TEXT_PLUS_REMOVE) - 1) == 0 ){
			if( esp8266_PlusStore_API_prepare_request(curPath, FALSE) == FALSE){
            	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
				return;
			}
        	HAL_UART_Transmit(&huart1, (uint8_t *)http_request_header, strlen(http_request_header), 50);

        	skip_http_header();
        	while(HAL_UART_Receive(&huart1, &c, 1, 50 ) == HAL_OK){}
        	if(c == '0')
        		set_menu_status_msg(STATUS_MESSAGE_PLUS_CONNECT_FAILED);
        	else
        		set_menu_status_msg(STATUS_MESSAGE_PLUS_REMOVED);

        	if( ! close_transparent_transmission() ){
            	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
        		return;
        	}

        	curPath[0] = '\0';

		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_DELETE_OFFLINE_ROMS, sizeof(MENU_TEXT_DELETE_OFFLINE_ROMS) - 1) == 0 ){
			HAL_FLASH_Unlock();
	        for( count = FLASH_SECTOR_5; count <= FLASH_SECTOR_11; count++){
		        FLASH_Erase_Sector((uint32_t) count, (uint8_t) FLASH_VOLTAGE_RANGE_3);
		    }
			HAL_FLASH_Lock();
    		set_menu_status_msg(STATUS_MESSAGE_OFFLINE_ROMS_DELETED);
        	curPath[0] = '\0';
		}else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PRIVATE_KEY, sizeof(MENU_TEXT_PRIVATE_KEY) - 1) == 0 ){
			if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Save Private key
				set_menu_status_msg(STATUS_MESSAGE_PRIVATE_KEY_SAVED);

	        	curPath[0] = '\0';
			}else{
				if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PRIVATE_KEY ) == 0){
					set_menu_status_msg(STATUS_MESSAGE_PRIVATE_KEY);
				}

				make_menu_entry(&dst, "(GO BACK)", Leave_Menu); // TODO Delete last Char or All?
				make_menu_entry(&dst, "(DEL CHAR)", Delete_Keyboard_Char); // TODO Delete last Char or All?
				char Key[2] = "0";
				for (char i=32; i < 96; i++){
					Key[0] = i;
					make_menu_entry(&dst, Key, Keyboard_Char);
				}
				make_menu_entry(&dst, "Enter", Menu_Action);
			}
		}
	}else if(strncmp(MENU_TEXT_OFFLINE_ROMS, curPath, sizeof(MENU_TEXT_OFFLINE_ROMS) - 1) == 0 ){
		make_menu_entry(&dst, "..", Leave_Menu);
		flash_file_list(&dst, &num_menu_entries);
	}else if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action..
		if(strncmp(MENU_TEXT_FIRMWARE_UPDATE, curPath, sizeof(MENU_TEXT_FIRMWARE_UPDATE) - 1) == 0 ){
			if( esp8266_PlusStore_API_prepare_request("&u=1", TRUE) == FALSE){
		    	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
			}
		    strcat(http_request_header, (char *)"     0-  4095\r\n\r\n");
			__disable_irq();
			HAL_FLASH_Unlock();
			do_flash_update(d->filesize, (uint8_t *)http_request_header, ADDR_FLASH_SECTOR_0, 0);
		} else if(strncmp(MENU_TEXT_OFFLINE_ROM_UPDATE, curPath, sizeof(MENU_TEXT_OFFLINE_ROM_UPDATE) - 1) == 0 ){
			if( esp8266_PlusStore_API_prepare_request("&r=1", TRUE) == FALSE){
		    	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
			}
		    strcat(http_request_header, (char *)"     0-  4095\r\n\r\n");
			__disable_irq();
			HAL_FLASH_Unlock();
			do_flash_update(d->filesize, (uint8_t *)http_request_header, ADDR_FLASH_SECTOR_5, 0);
		}

    	curPath[0] = '\0';
	}else{
		loadStore = TRUE;
	}

	// Test we should load store and if connected to AP
    if(	loadStore || strlen(curPath) == 0 ){
    	if(esp8266_is_connected() == TRUE){
			if( esp8266_PlusStore_API_prepare_request(curPath, FALSE) == FALSE){
            	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
				return;
			}

            HAL_UART_Transmit(&huart1, (uint8_t *)http_request_header, strlen(http_request_header), 50);
        	skip_http_header();
        	count = 0;
        	while(HAL_UART_Receive(&huart1, &c, 1, 50 ) == HAL_OK){
        		if(num_menu_entries < NUM_MENU_ITEMS){
                    if(count == 0){ // first char defines if its an entry row (or Header Row)
                    	is_entry_row = (c > '/' && c < ':' ) ? TRUE : FALSE; // First char is entry.type '0' to '9'
                        if(is_entry_row){
                        	dst->type = c - 48;
                        }
                    }else if( is_entry_row ){
                    	if(count == 1){
                            dst->filesize = 0U;
                            pos = 0;
                    	}else if( count < 8 ){ // get the filesize
                   			dst->filesize = dst->filesize * 10 + ( c -'0' );
                    	}else if( count > 8 && count < 41 && c != '\n'){ // filename/dirname should begin at index 9
                    		dst->entryname[pos] = c;
                    		pos++;
                    	}
                    }
                    if (c == '\n'){
                    	if(is_entry_row){
                            dst->entryname[pos] = '\0';
                            dst++;
                            num_menu_entries++;
                    	}
                        count = 0;
                    }else{
                        count++;
                    }
        		}
        	}

        	if(! close_transparent_transmission()){
            	set_menu_status_msg(STATUS_MESSAGE_ESP_TIMEOUT);
        		return;
        	}
        }else {
        	set_menu_status_msg(STATUS_MESSAGE_WIFI_NOT_CONNECTED);
    	}

