Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
    }

    if(strlen(curPath) == 0){
    	if(	flash_has_downloaded_roms() )
    		make_menu_entry(&dst, MENU_TEXT_OFFLINE_ROMS, Sub_Menu);

    	make_menu_entry(&dst, MENU_TEXT_SETUP, Sub_Menu);
	}
}


CART_TYPE identify_cartridge( MENU_ENTRY *d )
{

	unsigned int image_size = 0;
	CART_TYPE cart_type = { base_type_None, FALSE, FALSE };

	strcat(curPath, "/");
    strcat(curPath, d->entryname);

	// Test if connected to AP
    if(d->type == Cart_File && esp8266_is_connected() == FALSE ){
    	return cart_type;
    }

    // select type by file extension?
	char *ext = get_filename_ext(curPath);
	EXT_TO_CART_TYPE_MAP *p = ext_to_cart_type_map;
	while (p->ext) {
		if (strcasecmp(ext, p->ext) == 0) {
			cart_type = p->cart_type;
			break;
		}
		p++;
	}

	// Supercharger cartridges get special treatment, since we don't load the entire
	// file into the buffer here
	if (cart_type.base_type == base_type_None && (d->filesize % 8448) == 0)
		cart_type.base_type = base_type_AR;
	if (cart_type.base_type == base_type_AR){
		image_size = d->filesize;
		goto close;
	}


	uint32_t buffer_load = d->filesize > (BUFFER_SIZE * 1024)?(BUFFER_SIZE * 1024):d->filesize;
	uint8_t *tail = NULL;
	if(d->type == Cart_File )
		image_size = esp8266_PlusStore_API_file_request( buffer, curPath, 0, buffer_load );
	else
		image_size = flash_file_request( buffer, d->flash_base_address, 0, buffer_load );

	uint32_t not_loaded_bytes = d->filesize - buffer_load ;
	if( not_loaded_bytes > 0){
		uint32_t ccm_load = not_loaded_bytes > (CCM_RAM_SIZE * 1024)?(CCM_RAM_SIZE * 1024):not_loaded_bytes;
		if(d->type == Cart_File )
			image_size += esp8266_PlusStore_API_file_request( CCM_RAM, curPath, buffer_load, ccm_load );
		else
			image_size += flash_file_request( CCM_RAM, d->flash_base_address, buffer_load, ccm_load );

		tail = &CCM_RAM[ccm_load - 16];

		not_loaded_bytes -= ccm_load;
		if( not_loaded_bytes > 0){
			if(d->type == Cart_File ){
				cart_type.flash_part_address = (0x08020000 + 128 * 1024 * ( user_settings.first_free_flash_sector - 5));
				esp8266_PlusStore_API_prepare_request(curPath, TRUE);
			    strcat(http_request_header, (char *)"     0-  4095\r\n\r\n");
				__disable_irq();
				HAL_FLASH_Unlock();
				do_flash_update(not_loaded_bytes, (uint8_t *)http_request_header, cart_type.flash_part_address, (buffer_load + ccm_load)  );
			}else{
				cart_type.flash_part_address = d->flash_base_address + buffer_load + ccm_load;
			}
			image_size += not_loaded_bytes;
		}
	}



	cart_type.withPlusFunctions = isProbablyPLS(image_size, buffer);
	cart_type.withSuperChip =  isProbablySC(image_size, buffer);

	// disconnect here or if cart_type != CART_TYPE_NONE
	if (cart_type.base_type != base_type_None) goto close;

	// If we don't already know the type (from the file extension), then we
	// auto-detect the cart type - largely follows code in Stella's CartDetector.cpp

	if (image_size == 2*1024)
	{
		if (isProbablyCV(image_size, buffer))
			cart_type.base_type = base_type_CV;
		else
			cart_type.base_type = base_type_2K;
	}
	else if (image_size == 4*1024)
	{
		cart_type.base_type = base_type_4K;
	}
	else if (image_size == 8*1024)
	{
		// First check for *potential* F8
		int f8 = isPotentialF8(image_size, buffer);

		if (memcmp(buffer, buffer + 4096, 4096) == 0)
			cart_type.base_type = base_type_4K;
		else if (isProbablyE0(image_size, buffer))
			cart_type.base_type = base_type_E0;
		else if (isProbably3E(image_size, buffer))
			cart_type.base_type = base_type_3E;
		else if (isProbably3F(image_size, buffer))
			cart_type.base_type = base_type_3F;
		else if (isProbablyFE(image_size, buffer) && !f8)
			cart_type.base_type = base_type_FE;
		else if (isProbably0840(image_size, buffer))
			cart_type.base_type = base_type_0840;
		else
			cart_type.base_type = base_type_F8;
	}
	else if (image_size == 8*1024 + 3) {
		cart_type.base_type = base_type_PP;
	}
	else if(image_size >= 10240 && image_size <= 10496)
	{  // ~10K - Pitfall II
		cart_type.base_type = base_type_DPC;
	}
	else if (image_size == 12*1024)
	{
		cart_type.base_type = base_type_FA;
	}
	else if (image_size == 16*1024)
	{
		if (isProbablyE7(image_size, buffer))
			cart_type.base_type = base_type_E7;
		else if (isProbably3E(image_size, buffer))
			cart_type.base_type = base_type_3E;
		else
			cart_type.base_type = base_type_F6;
	}
	else if (image_size == 32*1024)
	{
		if (isProbably3E(image_size, buffer))
			cart_type.base_type = base_type_3E;
		else if (isProbably3F(image_size, buffer))
			cart_type.base_type = base_type_3F;
		else
			cart_type.base_type = base_type_F4;
	}
	else if (image_size == 64*1024)
	{
		if (isProbably3E(image_size, buffer))
			cart_type.base_type = base_type_3E;
		else if (isProbably3F(image_size, buffer))
			cart_type.base_type = base_type_3F;
		else if (isProbablyEF(image_size, buffer))
			cart_type.base_type = base_type_EF;
		else
			cart_type.base_type = base_type_F0;
	}
	else if (image_size == 128 * 1024) {
		if (isProbablyDF(tail))
			cart_type.base_type = base_type_DF;
		else if (isProbablyDFSC(tail))
			cart_type.base_type = base_type_DFSC;
	}
	else if (image_size == 256 * 1024)
	{
		if (isProbablyBF(tail))
			cart_type.base_type = base_type_BF;
		else if (isProbablyBFSC(tail))
			cart_type.base_type = base_type_BFSC;
	}

	close:

	if (cart_type.base_type != base_type_None)
		cart_size_bytes = image_size;

	return cart_type;
}




/*************************************************************************
 * Main loop/helper functions
 *************************************************************************/

void emulate_cartridge(CART_TYPE cart_type)
{
	int offset = 0;
	if (cart_type.withPlusFunctions == TRUE ){
 		// Read path and hostname in ROM File from 0xf00  till '\0' and
		// copy to http_request_header
		offset = connect_PlusROM_API();
	}

	if (cart_type.base_type == base_type_2K)
		emulate_2k_4k_cartridge(offset, cart_type.withPlusFunctions, 0x7FF);
	else if (cart_type.base_type == base_type_4K)
		emulate_2k_4k_cartridge(offset, cart_type.withPlusFunctions, 0xFFF);
	else if (cart_type.base_type == base_type_F8)
		emulate_FxSC_cartridge(offset, cart_type.withPlusFunctions, 0x1FF8, 0x1FF9, cart_type.withSuperChip);
	else if (cart_type.base_type == base_type_F6)
		emulate_FxSC_cartridge(offset, cart_type.withPlusFunctions, 0x1FF6, 0x1FF9, cart_type.withSuperChip);
	else if (cart_type.base_type == base_type_F4)
		emulate_FxSC_cartridge(offset, cart_type.withPlusFunctions, 0x1FF4, 0x1FFB, cart_type.withSuperChip );
	else if (cart_type.base_type == base_type_FE)
		emulate_FE_cartridge();
	else if (cart_type.base_type == base_type_3F)
		emulate_3F_cartridge();
	else if (cart_type.base_type == base_type_3E)
		emulate_3E_cartridge(offset, cart_type.withPlusFunctions);
	else if (cart_type.base_type == base_type_E0)
		emulate_E0_cartridge();
	else if (cart_type.base_type == base_type_0840)
		emulate_0840_cartridge();
	else if (cart_type.base_type == base_type_CV)
		emulate_CV_cartridge();
	else if (cart_type.base_type == base_type_EF)
		emulate_FxSC_cartridge(offset, cart_type.withPlusFunctions, 0x1FE0, 0x1FEF, cart_type.withSuperChip);
	else if (cart_type.base_type == base_type_F0)
		emulate_F0_cartridge();
	else if (cart_type.base_type == base_type_FA)
		emulate_FA_cartridge();
	else if (cart_type.base_type == base_type_E7)
		emulate_E7_cartridge();
	else if (cart_type.base_type == base_type_DPC)
		emulate_DPC_cartridge(cart_size_bytes);
	else if (cart_type.base_type == base_type_AR)
		emulate_supercharger_cartridge(curPath, cart_size_bytes, buffer, user_settings.tv_mode);
	else if (cart_type.base_type == base_type_PP)
		emulate_pp_cartridge( buffer + 8*1024);
	else if (cart_type.base_type == base_type_DF)
		emulate_df_cartridge();
	else if (cart_type.base_type == base_type_DFSC)
		emulate_dfsc_cartridge();
	else if (cart_type.base_type == base_type_BF)
		emulate_bf_cartridge(cart_type.flash_part_address);
	else if (cart_type.base_type == base_type_BFSC)
		emulate_bfsc_cartridge(cart_type.flash_part_address);

